IdeaRS.OpenModel.Connection.ReportType
Defines a report type.

IdeaRS.OpenModel.Connection.ReportType.Brief
Brief report - only summary is created.

IdeaRS.OpenModel.Connection.ReportType.Detailed
Detailed report - with all results related to report settings.